tests/tsoutTOOF/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"




convertToMeters 1.0;

vertices        
(
    ( $xMin   $yMin   $zMin)
    ( $xMax   $yMin   $zMin)
    ( $xMax   $yMax   $zMin)
    ( $xMin   $yMax   $zMin)
    ( $xMin   $yMin   $zMax)
    ( $xMax   $yMin   $zMax)
    ( $xMax   $yMax   $zMax)
    ( $xMin   $yMax   $zMax)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    lower
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upper
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    west
    { 
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    east
    { 
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    north
    { 
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    south
    { 
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
